#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem               = (sensitive value)
      + certificate_domain            = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "rewards.josh.services"
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "4096"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 60
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = false

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "linode"
        }
    }

  # acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "linode@dangerous.tech"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # linode_domain.domain will be created
  + resource "linode_domain" "domain" {
      + domain    = "josh.services"
      + id        = (known after apply)
      + soa_email = "linode@dangerous.tech"
      + status    = (known after apply)
      + tags      = [
          + "fealty",
        ]
      + ttl_sec   = 30
      + type      = "master"
    }

  # linode_domain_record.rewards will be created
  + resource "linode_domain_record" "rewards" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "rewards"
      + record_type = "A"
      + target      = (known after apply)
      + ttl_sec     = 30
    }

  # linode_firewall.fealty_fw[0] will be created
  + resource "linode_firewall" "fealty_fw" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "fealty-fw"
      + linodes         = (known after apply)
      + outbound_policy = "ACCEPT"
      + status          = (known after apply)
      + tags            = [
          + "fealty",
        ]

      + inbound {
          + action   = "ACCEPT"
          + ipv4     = (known after apply)
          + ipv6     = (known after apply)
          + label    = "allow-nodebalancer"
          + protocol = "TCP"
        }
      + inbound {
          + action   = "DROP"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "drop-inbound-udp"
          + protocol = "UDP"
        }
      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-inbound-icmp"
          + protocol = "ICMP"
        }

      + outbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-https"
          + ports    = "443"
          + protocol = "TCP"
        }
    }

  # linode_instance.app[0] will be created
  + resource "linode_instance" "app" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = false
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty-app-1"
      + private_ip         = true
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + purpose = "public"
        }
      + interface {
          + ipam_address = "10.10.10.2/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_instance.db will be created
  + resource "linode_instance" "db" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty-db"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + ipam_address = "10.10.10.3/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_nodebalancer.app_nb will be created
  + resource "linode_nodebalancer" "app_nb" {
      + client_conn_throttle = 20
      + created              = (known after apply)
      + hostname             = (known after apply)
      + id                   = (known after apply)
      + ipv4                 = (known after apply)
      + ipv6                 = (known after apply)
      + label                = "fealty-nodebalancer"
      + region               = "us-southeast"
      + tags                 = [
          + "fealty",
        ]
      + transfer             = (known after apply)
      + updated              = (known after apply)
    }

  # linode_nodebalancer_config.app_nb_config will be created
  + resource "linode_nodebalancer_config" "app_nb_config" {
      + algorithm       = "leastconn"
      + check           = "http"
      + check_attempts  = 3
      + check_body      = (known after apply)
      + check_interval  = 30
      + check_passive   = (known after apply)
      + check_path      = "/healthz"
      + check_timeout   = 5
      + cipher_suite    = "recommended"
      + id              = (known after apply)
      + node_status     = (known after apply)
      + nodebalancer_id = (known after apply)
      + port            = 443
      + protocol        = "https"
      + proxy_protocol  = "none"
      + ssl_cert        = (sensitive value)
      + ssl_commonname  = (known after apply)
      + ssl_fingerprint = (known after apply)
      + ssl_key         = (sensitive value)
      + stickiness      = "http_cookie"
    }

  # linode_nodebalancer_node.app_nb_node[0] will be created
  + resource "linode_nodebalancer_node" "app_nb_node" {
      + address         = (known after apply)
      + config_id       = (known after apply)
      + id              = (known after apply)
      + label           = "app-node-1"
      + mode            = "accept"
      + nodebalancer_id = (known after apply)
      + status          = (known after apply)
      + weight          = (known after apply)
    }

  # tls_private_key.private_key will be created
  + resource "tls_private_key" "private_key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + DB_Private_IP         = []
  + Domain_IP             = (known after apply)
  + NodeBalancer_Hostname = (known after apply)
  + NodeBalancer_IPv4     = (known after apply)
  + NodeBalancer_IPv6     = (known after apply)
  + SSL_Cert_Domain       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*